emacs-config.org
#+TITLE:     Emacs config file 
#+AUTHOR:    DDOSvoid
#+DATE:      2023-11-01 18:10:23

#+STARTUP: overview

* early-init.el
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:

在Emacs刚启动，还未加载主要配置文件时的配置文件。

#+BEGIN_SRC emacs-lisp
;;; early-init.el --- Emacs pre-initialization config -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

;; 设置垃圾回收参数
(setq gc-cons-threshold (* 16 1024 1024))
(setq gc-cons-percentage 0.6)

;; 启动早期不加载`package.el'包管理器
(setq package-enable-at-startup nil)
;; 不从包缓存中加载
(setq package-quickstart nil)

;; 禁止展示菜单栏、工具栏和纵向滚动条
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

;; 禁止自动缩放窗口先
(setq frame-inhibit-implied-resize t)

;; 禁止菜单栏、工具栏、滚动条模式，禁止启动屏幕和文件对话框
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-splash-screen t)
(setq use-file-dialog nil)

;; 在这个阶段不编译
(setq comp-deferred-compilation nil)

(provide 'early-init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; early-init.el ends here
#+END_SRC

* init.el
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:

** init.el header

#+BEGIN_SRC emacs-lisp
;;; init.el --- The main init entry for Emacs -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC

** package

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-archives
        '(("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
          ("melpa-stable" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/stable-melpa/")
          ("gnu" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")))
  (package-initialize)
#+END_SRC 

** use-package
[[https://github.com/jwiegley/use-package][use-package]]

#+BEGIN_SRC emacs-lisp
  ;; 安装 `use-package'
  ;; become built-in in Emacs 29.1
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  ;; 配置 `use-package'
  (eval-and-compile
    (setq use-package-always-ensure nil)
    (setq use-package-always-defer nil)
    (setq use-package-expand-minimally nil)
    (setq use-package-enable-imenu-support t)
    (if (daemonp)
        (setq use-package-always-demand t)))

  (eval-when-compile
    (require 'use-package))

  ;; 安装 `use-package' 的集成模块
  (use-package use-package-ensure-system-package
    :ensure t)
  (use-package diminish
    :ensure t)
  (use-package bind-key
    :ensure t)
#+END_SRC

** quelpa
Reference:
+ [[https://github.com/quelpa/quelpa][quelpa/quelpa: Build and install your Emacs Lisp packages on-the-fly directly from source]]
+ [[https://github.com/quelpa/quelpa-use-package][quelpa/quelpa-use-package: Emacs quelpa handler for use-package]]

#+BEGIN_SRC emacs-lisp
(use-package quelpa
  :ensure t
  :commands quelpa
  :custom
  (quelpa-git-clone-depth 1)
  (quelpa-update-melpa-p nil)
  (quelpa-self-upgrade-p nil)
  (quelpa-checkout-melpa-p nil))

;; `quelpa' 与 `use-package' 集成
(use-package quelpa-use-package
  :ensure t)
(use-package quelpa
  :ensure t)
#+END_SRC 

** loading config

#+BEGIN_SRC emacs-lisp
  ;; 将lisp目录放到加载路径的前面以加快启动速度
  (let ((dir (locate-user-emacs-file "lisp")))
    (add-to-list 'load-path (file-name-as-directory dir)))

  ;; 加载各模块化配置
  ;; 不要在`*message*'缓冲区显示加载模块化配置的信息
  (with-temp-message ""
    (require 'init-ui) 
    (require 'init-base)
    (require 'init-edit) 
    (require 'init-org)
    (require 'init-completion)
    (require 'init-dev)
    )
#+END_SRC

** other config

Reference:
+ [[https://emacs-china.org/t/emacs/6731/4][emacs 修改文件提示没有权限 - Emacs-general - Emacs China]]

#+BEGIN_SRC emacs-lisp
  ;; F2 to open init file
  (defun ddosvoid/open-init-file()
    (interactive)
    (find-file "~/.emacs.d/emacs-config.org"))
  (global-set-key (kbd "<f2>") 'ddosvoid/open-init-file)

  ;; sudo find-file
  (defun ddosvoid/sudo-edit-current-file ()
    (interactive)
    (when (buffer-file-name)
      (let ((old-point (point)))
        (find-file (concat "/sudo:root@localhost:" (buffer-file-name)))
        (goto-char old-point))))

  ;; set proxy in wsl2
  (defvar default-proxy "172.26.0.1:7890")
  (defun ddosvoid/proxy-http-show ()
    "Show HTTP/HTTPS proxy."
    (interactive)
    (if url-proxy-services
        (message "Current HTTP proxy is `%s'" default-proxy)
      (message "No HTTP proxy")))

  (defun ddosvoid/proxy-http-enable ()
    "Enable HTTP/HTTPS proxy."
    (interactive)
    (setq url-proxy-services
          `(("http" . ,default-proxy)
            ("https" . ,default-proxy)
            ("no_proxy" . "^\\(localhost\\|192.168.*\\|10.*\\)")))
    (ddosvoid/proxy-http-show))

  (defun ddosvoid/proxy-http-disable ()
    "Disable HTTP/HTTPS proxy."
    (interactive)
    (setq url-proxy-services nil)
    (ddosvoid/proxy-http-show))

  (defun ddosovid/proxy-http-toggle ()
    "Toggle HTTP/HTTPS proxy."
    (interactive)
    (if (bound-and-true-p url-proxy-services)
        (ddosvoid/proxy-http-disable)
      (ddosvoid/proxy-http-enable)))

#+END_SRC

** init.el footer

#+BEGIN_SRC emacs-lisp

(provide 'init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init.el ends here
#+END_SRC 

* init-ui.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ui.el :mkdirp yes
:END:

** init-ui.el header

#+BEGIN_SRC emacs-lisp
;;; init-ui.el --- UI settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC

** ef-themes
   
[[https://protesilaos.com/emacs/ef-themes][ef themes]]

#+BEGIN_SRC emacs-lisp
  (use-package ef-themes
    :ensure t
    :bind ("C-c t" . ef-themes-toggle)
    :init
    ;; set two specific themes and switch between them
    (setq ef-themes-to-toggle '(ef-cyprus ef-night))

    ;; set org headings and function syntax
    ;; (setq ef-themes-headings
    ;;       '((0 . (bold 1))
    ;;         (1 . (bold 1))
    ;;         (2 . (rainbow bold 1))
    ;;         (3 . (rainbow bold 1))
    ;;         (4 . (rainbow bold 1))
    ;;         (t . (rainbow bold 1))))
    ;; (setq ef-themes-region '(intense no-extend neutral))

    ;; Disable all other themes to avoid awkward blending:
    (mapc #'disable-theme custom-enabled-themes)

    ;; Load the theme of choice:
    ;; The themes we provide are recorded in the `ef-themes-dark-themes',
    ;; `ef-themes-light-themes'.

    ;; 如果你不喜欢随机主题，也可以直接固定选择一个主题，如下：
    (ef-themes-select 'ef-cyprus)

    ;; 随机挑选一款主题，如果是命令行打开Emacs，则随机挑选一款黑色主题
    ;;(if (display-graphic-p)
    ;;    (ef-themes-load-random)
    ;;  (ef-themes-load-random 'dark))

    :config
    ;; auto change theme, aligning with system themes.
    (defun my/apply-theme (appearance)
      "Load theme, taking current system APPEARANCE into consideration."
      (mapc #'disable-theme custom-enabled-themes)
      (pcase appearance
        ('light (if (display-graphic-p) (ef-themes-load-random 'light) (ef-themes-load-random 'dark)))
        ('dark (ef-themes-load-random 'dark))))

    ;;(if (eq system-type 'darwin)
        ;; only for emacs-plus
    ;;    (add-hook 'ns-system-appearance-change-functions #'my/apply-theme)
    ;;  (ef-themes-select 'ef-summer)
    ;;  )
    )
#+END_SRC

** doom-themes [deprecated]

[[https://github.com/doomemacs/themes][doom-themes]]

#+begin_src emacs-lisp :tangle no
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Load theme
    (load-theme 'doom-1337 t)          ; doom-city-lights, doom-gruvbox and doom-1337

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src

** eshell-git-prompt

[[https://github.com/xuchunyang/eshell-git-prompt/tree/master][eshell-git-prompt]]

#+begin_src emacs-lisp
  (use-package eshell-git-prompt
    :ensure t
    :config
    (eshell-git-prompt-use-theme 'robbyrussell))
#+end_src

** all-the-icons

[[https://github.com/domtronn/all-the-icons.el][all-the-icons]]

Use M-x all-the-icons-install-fonts to install the Resource Fonts.

#+BEGIN_SRC emacs-lisp
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))
#+END_SRC

** nerd-icons

[[https://github.com/rainstormstudio/nerd-icons.el][nerd-icons.el]]

Use M-x nerd-icons-install-fonts to install Symbols Nerd Fonts Mono.

#+BEGIN_SRC emacs-lisp
  (use-package nerd-icons
    :ensure t
    ;; :custom
    ;; The Nerd Font you want to use in GUI
    ;; "Symbols Nerd Font Mono" is the default and is recommended
    ;; but you can use any other Nerd Font if you want
    ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
    )
#+END_SRC

** fontaine

[[https://protesilaos.com/emacs/fontaine][fontaine]]

Need to download [[https://github.com/laishulu/Sarasa-Mono-SC-Nerd][Sarasa-Mono-SC-Nerd]] and [[https://fonts.google.com/specimen/Source+Code+Pro][Source code Pro]] in advance. 

#+BEGIN_SRC emacs-lisp
(use-package fontaine
  :ensure t
  :when (display-graphic-p)
  ;; :hook (kill-emacs . fontaine-store-latest-preset)
  :config
  (setq fontaine-latest-state-file
        (locate-user-emacs-file "etc/fontaine-latest-state.eld"))
  (setq fontaine-presets
        '((regular
           :default-height 140
           :default-weight regular
           :fixed-pitch-height 1.0
           :variable-pitch-height 1.0
           )
          (large
           :default-height 180
           :default-weight normal
           :fixed-pitch-height 1.0
           :variable-pitch-height 1.05
           )
          (t
           :default-family "Source Code Pro"
           :fixed-pitch-family "Source Code Pro"
           :variable-pitch-family "Source Code Pro"
           :italic-family "Source Code Pro"
           :variable-pitch-weight normal
           :bold-weight normal
           :italic-slant italic
           :line-spacing 0.1)
          ))
  ;; (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))
  (fontaine-set-preset 'regular)

  ;; set emoji font
  (set-fontset-font
   t
   (if (version< emacs-version "28.1")
       '(#x1f300 . #x1fad0)
     'emoji)
   (cond
    ((member "Noto Emoji" (font-family-list)) "Noto Emoji")
    ((member "Symbola" (font-family-list)) "Symbola")
    ((member "Apple Color Emoji" (font-family-list)) "Apple Color Emoji")
    ((member "Noto Color Emoji" (font-family-list)) "Noto Color Emoji")
    ((member "Segoe UI Emoji" (font-family-list)) "Segoe UI Emoji")
    ))

  ;; set Chinese font
  (dolist (charset '(kana han symbol cjk-misc bopomofo))
    (set-fontset-font
     (frame-parameter nil 'font)
     charset
     (font-spec :family
                (cond
                 ((eq system-type 'darwin)
                  (cond
                   ((member "Sarasa Mono SC Nerd" (font-family-list)) "Sarasa Mono SC Nerd")
                   ((member "PingFang SC" (font-family-list)) "PingFang SC")
                   ((member "WenQuanYi Zen Hei" (font-family-list)) "WenQuanYi Zen Hei")
                   ((member "Microsoft YaHei" (font-family-list)) "Microsoft YaHei")
                   ))
                 ((eq system-type 'gnu/linux)
                  (cond
                   ((member "Sarasa Mono SC Nerd" (font-family-list)) "Sarasa Mono SC Nerd")
                   ((member "WenQuanYi Micro Hei" (font-family-list)) "WenQuanYi Micro Hei")
                   ((member "WenQuanYi Zen Hei" (font-family-list)) "WenQuanYi Zen Hei")
                   ((member "Microsoft YaHei" (font-family-list)) "Microsoft YaHei")
                   ))
                 (t
                  (cond
                   ((member "Sarasa Mono SC Nerd" (font-family-list)) "Sarasa Mono SC Nerd")
                   ((member "Microsoft YaHei" (font-family-list)) "Microsoft YaHei")
                   )))
                )))

  ;; set Chinese font scale
  (setq face-font-rescale-alist `(
                                  ("Symbola"             . 1.3)
                                  ("Microsoft YaHei"     . 1.2)
                                  ("WenQuanYi Zen Hei"   . 1.2)
                                  ("Sarasa Mono SC Nerd" . 1.2)
                                  ("PingFang SC"         . 1.16)
                                  ("Lantinghei SC"       . 1.16)
                                  ("Kaiti SC"            . 1.16)
                                  ("Yuanti SC"           . 1.16)
                                  ("Apple Color Emoji"   . 0.91)
                                  ))
  )
#+END_SRC

