emacs-config.org
** org-mode config

#+BEGIN_SRC emacs-lisp
  (use-package org
    :ensure nil
    :mode ("\\.org\\'" . org-mode)
    :hook ((org-mode . visual-line-mode))
    :commands (org-find-exact-headline-in-buffer org-set-tags)
    :custom-face
    ;; 设置Org mode标题以及每级标题行的大小
    (org-document-title ((t (:height 1.75 :weight bold))))
    (org-level-1 ((t (:height 1.2 :weight bold))))
    (org-level-2 ((t (:height 1.15 :weight bold))))
    (org-level-3 ((t (:height 1.1 :weight bold))))
    (org-level-4 ((t (:height 1.05 :weight bold))))
    (org-level-5 ((t (:height 1.0 :weight bold))))
    (org-level-6 ((t (:height 1.0 :weight bold))))
    (org-level-7 ((t (:height 1.0 :weight bold))))
    (org-level-8 ((t (:height 1.0 :weight bold))))
    (org-level-9 ((t (:height 1.0 :weight bold))))
    ;; 设置代码块用上下边线包裹
    ;; (org-block-begin-line ((t (:underline t :background unspecified))))
    ;; (org-block-end-line ((t (:overline t :underline nil :background unspecified))))
    :config
    ;; 提升latex预览的图片清晰度
    (plist-put org-format-latex-options :scale 1.8)

    ;; 设置标题行之间总是有空格；列表之间根据情况自动加空格
    (setq org-blank-before-new-entry '((heading . t)
                                       (plain-list-item . auto)
                                       ))
    ;; 
    (setq org-startup-indented t) 

    ;; ======================================
    ;; 设置打开Org links的程序
    ;; ======================================
    (defun my-func/open-and-play-gif-image (file &optional link)
      "Open and play GIF image `FILE' in Emacs buffer.

  Optional for Org-mode file: `LINK'."
      (let ((gif-image (create-image file))
            (tmp-buf (get-buffer-create "*Org-mode GIF image animation*")))
        (switch-to-buffer tmp-buf)
        (erase-buffer)
        (insert-image gif-image)
        (image-animate gif-image nil t)
        (local-set-key (kbd "q") 'bury-buffer)
        ))
    (setq org-file-apps '(("\\.png\\'"     . default)
                          (auto-mode       . emacs)
                          (directory       . emacs)
                          ("\\.mm\\'"      . default)
                          ("\\.x?html?\\'" . default)
                          ("\\.pdf\\'"     . emacs)
                          ("\\.md\\'"      . emacs)
                          ("\\.gif\\'"     . my-func/open-and-play-gif-image)
                          ("\\.xlsx\\'"    . default)
                          ("\\.svg\\'"     . default)
                          ("\\.pptx\\'"    . default)
                          ("\\.docx\\'"    . default)))

    :custom
    ;; 设置Org mode的目录
    (org-directory "~/org")
    ;; 设置笔记的默认存储位置
    (org-default-notes-file (expand-file-name "capture.org" org-directory))
    ;; 启用一些子模块
    (org-modules '(ol-bibtex ol-gnus ol-info ol-eww org-habit org-protocol))
    ;; 在按M-RET时，是否根据光标所在的位置分行，这里设置为是
    ;; (org-M-RET-may-split-line '((default . nil)))
    ;; 一些Org mode自带的美化设置
    ;; 标题行美化
    (org-fontify-whole-heading-line t)
    ;; 设置标题行折叠符号
    (org-ellipsis " ▾")
    ;; 在活动区域内的所有标题栏执行某些命令
    (org-loop-over-headlines-in-active-region t)
    ;; TODO标签美化
    (org-fontify-todo-headline t)
    ;; DONE标签美化
    (org-fontify-done-headline t)
    ;; 引用块美化
    (org-fontify-quote-and-verse-blocks t)
    ;; 隐藏宏标记
    (org-hide-macro-markers t)
    ;; 隐藏强调标签
    (org-hide-emphasis-markers t)
    ;; 高亮latex语法
    (org-highlight-latex-and-related '(native script entities))
    ;; 以UTF-8显示
    (org-pretty-entities t)
    ;; 是否隐藏标题栏的前置星号，这里我们通过org-modern来隐藏
    ;; (org-hide-leading-stars t)
    ;; 当启用缩进模式时自动隐藏前置星号
    (org-indent-mode-turns-on-hiding-stars t)
    ;; 自动启用缩进
    (org-startup-indented nil)
    ;; 根据标题栏自动缩进文本
    (org-adapt-indentation nil)
    ;; 自动显示图片
    (org-startup-with-inline-images t)
    ;; 默认以Overview的模式展示标题行
    (org-startup-folded 'overview)
    ;; 允许字母列表
    (org-list-allow-alphabetical t)
    ;; 列表的下一级设置
    (org-list-demote-modify-bullet '(
                                     ("-"  . "+")
                                     ("+"  . "1.")
                                     ("1." . "a.")
                                     ))
    ;; 编辑时检查是否在折叠的不可见区域
    (org-fold-catch-invisible-edits 'smart)
    ;; 在当前位置插入新标题行还是在当前标题行后插入，这里设置为当前位置
    (org-insert-heading-respect-content nil)
    ;; 设置图片的最大宽度，如果有imagemagick支持将会改变图片实际宽度
    ;; 四种设置方法：(1080), 1080, t, nil
    (org-image-actual-width nil)
    ;; imenu的最大深度，默认为2
    (org-imenu-depth 4)
    ;; 回车要不要触发链接，这里设置不触发
    (org-return-follows-link nil)
    ;; 上标^下标_是否需要特殊字符包裹，这里设置需要用大括号包裹
    (org-use-sub-superscripts '{})
    ;; 复制粘贴标题行的时候删除id
    (org-clone-delete-id t)
    ;; 粘贴时调整标题行的级别
    (org-yank-adjusted-subtrees t)

    ;; TOOD的关键词设置，可以设置不同的组
    (org-todo-keywords '((sequence "TODO(t)" "HOLD(h!)" "WIP(i!)" "WAIT(w!)" "|" "DONE(d!)" "CANCELLED(c@/!)")
                         (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f!)")))
    ;; TODO关键词的样式设置
    (org-todo-keyword-faces '(("TODO"       :foreground "#7c7c75" :weight bold)
                              ("HOLD"       :foreground "#feb24c" :weight bold)
                              ("WIP"        :foreground "#0098dd" :weight bold)
                              ("WAIT"       :foreground "#9f7efe" :weight bold)
                              ("DONE"       :foreground "#50a14f" :weight bold)
                              ("CANCELLED"  :foreground "#ff6480" :weight bold)
                              ("REPORT"     :foreground "magenta" :weight bold)
                              ("BUG"        :foreground "red"     :weight bold)
                              ("KNOWNCAUSE" :foreground "yellow"  :weight bold)
                              ("FIXED"      :foreground "green"   :weight bold)))
    ;; 当标题行状态变化时标签同步发生的变化
    ;; Moving a task to CANCELLED adds a CANCELLED tag
    ;; Moving a task to WAIT adds a WAIT tag
    ;; Moving a task to HOLD adds WAIT and HOLD tags
    ;; Moving a task to a done state removes WAIT and HOLD tags
    ;; Moving a task to TODO removes WAIT, CANCELLED, and HOLD tags
    ;; Moving a task to DONE removes WAIT, CANCELLED, and HOLD tags
    (org-todo-state-tags-triggers
     (quote (("CANCELLED" ("CANCELLED" . t))
             ("WAIT" ("WAIT" . t))
             ("HOLD" ("WAIT") ("HOLD" . t))
             (done ("WAIT") ("HOLD"))
             ("TODO" ("WAIT") ("CANCELLED") ("HOLD"))
             ("DONE" ("WAIT") ("CANCELLED") ("HOLD")))))
    ;; 使用专家模式选择标题栏状态
    (org-use-fast-todo-selection 'expert)
    ;; 父子标题栏状态有依赖
    (org-enforce-todo-dependencies t)
    ;; 标题栏和任务复选框有依赖
    (org-enforce-todo-checkbox-dependencies t)
    ;; 优先级样式设置
    (org-priority-faces '((?A :foreground "red")
                          (?B :foreground "orange")
                          (?C :foreground "yellow")))
    ;; 标题行全局属性设置
    (org-global-properties '(("EFFORT_ALL" . "0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00")
                             ("APPT_WARNTIME_ALL" . "0 5 10 15 20 25 30 45 60")
                             ("RISK_ALL" . "Low Medium High")
                             ("STYLE_ALL" . "habit")))
    ;; Org columns的默认格式
    (org-columns-default-format "%25ITEM %TODO %SCHEDULED %DEADLINE %3PRIORITY %TAGS %CLOCKSUM %EFFORT{:}")
    ;; 当状态从DONE改成其他状态时，移除 CLOSED: [timestamp]
    (org-closed-keep-when-no-todo t)
    ;; DONE时加上时间戳
    (org-log-done 'time)
    ;; 重复执行时加上时间戳
    (org-log-repeat 'time)
    ;; Deadline修改时加上一条记录
    (org-log-redeadline 'note)
    ;; Schedule修改时加上一条记录
    (org-log-reschedule 'note)
    ;; 以抽屉的方式记录
    (org-log-into-drawer t)
    ;; 紧接着标题行或者计划/截止时间戳后加上记录抽屉
    (org-log-state-notes-insert-after-drawers nil)

    ;; refile使用缓存
    (org-refile-use-cache t)
    ;; refile的目的地，这里设置的是agenda文件的所有标题
    (org-refile-targets '((org-agenda-files . (:maxlevel . 9))))
    ;; 将文件名加入到路径
    (org-refile-use-outline-path 'file)
    ;; 是否按步骤refile
    (org-outline-path-complete-in-steps nil)
    ;; 允许创建新的标题行，但需要确认
    (org-refile-allow-creating-parent-nodes 'confirm)

    ;; 设置标签的默认位置，默认是第77列右对齐
    ;; (org-tags-column -77)
    ;; 自动对齐标签
    (org-auto-align-tags t)
    ;; 标签不继承
    (org-use-tag-inheritance nil)
    ;; 在日程视图的标签不继承
    (org-agenda-use-tag-inheritance nil)
    ;; 标签快速选择
    (org-use-fast-tag-selection t)
    ;; 标签选择不需要回车确认
    (org-fast-tag-selection-single-key t)
    ;; 定义了有序属性的标题行也加上 OREDERD 标签
    (org-track-ordered-property-with-tag t)
    ;; 始终存在的的标签
    (org-tag-persistent-alist '(("read"     . ?r)
                                ("mail"     . ?m)
                                ("emacs"    . ?e)
                                ("study"    . ?s)
                                ("work"     . ?w)))
    ;; 预定义好的标签
    (org-tag-alist '((:startgroup)
                     ("crypt"    . ?c)
                     ("linux"    . ?l)
                     ("apple"    . ?a)
                     ("noexport" . ?n)
                     ("ignore"   . ?i)
                     ("TOC"      . ?t)
                     (:endgroup)))

    ;; 归档设置
    (org-archive-location "%s_archive::datetree/")
    )
#+END_SRC 

** org-modern

[[https://github.com/minad/org-modern][org-modern]]

#+BEGIN_SRC emacs-lisp
(use-package org-modern
  :ensure t
  :hook (after-init . (lambda ()
                        (setq org-modern-hide-stars 'leading)
                        (global-org-modern-mode t)))
  :config
  ;; 标题行型号字符
  (setq org-modern-star ["◉" "○" "✸" "✳" "◈" "◇" "✿" "❀" "✜"])
  ;; 额外的行间距，0.1表示10%，1表示1px
  (setq-default line-spacing 0.1)
  ;; tag边框宽度，还可以设置为 `auto' 即自动计算
  (setq org-modern-label-border 1)
  ;; 设置表格竖线宽度，默认为3
  (setq org-modern-table-vertical 2)
  ;; 设置表格横线为0，默认为0.1
  (setq org-modern-table-horizontal 0)
  ;; 复选框美化
  (setq org-modern-checkbox
        '((?X . #("▢✓" 0 2 (composition ((2)))))
          (?- . #("▢–" 0 2 (composition ((2)))))
          (?\s . #("▢" 0 1 (composition ((1)))))))
  ;; 列表符号美化
  (setq org-modern-list
        '((?- . "•")
          (?+ . "◦")
          (?* . "▹")))
  ;; 代码块左边加上一条竖边线（需要Org mode顶头，如果启用了 `visual-fill-column-mode' 会很难看）
  (setq org-modern-block-fringe t)
  ;; 代码块类型美化，我们使用了 `prettify-symbols-mode'
  (setq org-modern-block-name nil)
  ;; #+关键字美化，我们使用了 `prettify-symbols-mode'
  (setq org-modern-keyword nil)
  )
#+END_SRC 

** org-appear

[[https://github.com/awth13/org-appear][org-appear]]

#+BEGIN_SRC emacs-lisp
(use-package org-appear
  :ensure t
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t)
  (setq org-appear-autosubmarkers t)
  (setq org-appear-autoentities t)
  (setq org-appear-autokeywords t)
  (setq org-appear-inside-latex t)
  )
#+END_SRC

** org-capture

See this blog for more information about org-capture. [[https://www.zmonster.me/2018/02/28/org-mode-capture.html#org1a3d856][强大的 Org mode(4): 使用 capture 功能快速记录]]

#+BEGIN_SRC emacs-lisp
(use-package org-capture
  :ensure nil
  :bind ("\e\e c" . (lambda () (interactive) (org-capture)))
  :hook ((org-capture-mode . (lambda ()
                               (setq-local org-complete-tags-always-offer-all-agenda-tags t)))
         (org-capture-mode . delete-other-windows))
  :custom
  (org-capture-use-agenda-date nil)
  ;; define common template
  (org-capture-templates `(("t" "Tasks" entry (file+headline "tasks.org" "Reminders")
                            "* TODO %i%?"
                            :empty-lines-after 1
                            :prepend t)))
  )
#+END_SRC

** denote

[[https://protesilaos.com/emacs/denote][denote]]

#+BEGIN_SRC emacs-lisp
  (use-package denote
    :ensure t
    :hook (dired-mode . denote-dired-mode-in-directories)
    :bind (("C-c d n" . denote)
           ("C-c d d" . denote-date)
           ("C-c d t" . denote-type)
           ("C-c d s" . denote-subdirectory)
           ("C-c d f" . denote-open-or-create)
           ("C-c d r" . denote-dired-rename-file))
    :init
    (with-eval-after-load 'org-capture
      (setq denote-org-capture-specifiers "%l\n%i\n%?")
      (add-to-list 'org-capture-templates
                   '("N" "New note (with denote.el)" plain
                     (file denote-last-path)
                     #'denote-org-capture
                     :no-save t
                     :immediate-finish nil
                     :kill-buffer t
                     :jump-to-captured t)))
    :config
    (setq denote-directory (expand-file-name "~/org/"))
    (setq denote-known-keywords '("emacs" "cpp" "linux" "commom" "cheatsheet" "finance"))
    (setq denote-infer-keywords t)
    (setq denote-sort-keywords t)
    ;; org is default, set others such as text, markdown-yaml, markdown-toml
    (setq denote-file-type nil)
    (setq denote-prompts '(title keywords))

    ;; We allow multi-word keywords by default.  The author's personal
    ;; preference is for single-word keywords for a more rigid workflow.
    (setq denote-allow-multi-word-keywords t)
    (setq denote-date-format nil)

    ;; DEPRECATED
    ;; If you use Markdown or plain text files (Org renders links as buttons
    ;; right away)
    ;; (add-hook 'find-file-hook #'denote-link-buttonize-buffer)
    ;; (setq denote-dired-rename-expert nil)
    ;; OR if only want it in `denote-dired-directories':
    ;; (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)
    )
#+END_SRC

** consult-notes

[[https://github.com/mclear-tools/consult-notes][consult-notes]]

#+begin_src emacs-lisp
  (use-package consult-notes
    :ensure t
    :commands (consult-notes
               consult-notes-search-in-all-notes)
    :bind (("C-c n f" . consult-notes)
           ("C-c n c" . consult-notes-search-in-all-notes))
    :config
    (setq consult-notes-file-dir-sources
          `(("org"     ?o ,(concat org-directory "/"))))

    ;; embark support
    (with-eval-after-load 'embark
      (defun consult-notes-open-dired (cand)
        "Open notes directory dired with point on file CAND."
        (interactive "fNote: ")
        ;; dired-jump is in dired-x.el but is moved to dired in Emacs 28
        (dired-jump nil cand))

      (defun consult-notes-marked (cand)
        "Open a notes file CAND in Marked 2.
  Marked 2 is a mac app that renders markdown."
        (interactive "fNote: ")
        (call-process-shell-command (format "open -a \"Marked 2\" \"%s\"" (expand-file-name cand))))

      (defun consult-notes-grep (cand)
        "Run grep in directory of notes file CAND."
        (interactive "fNote: ")
        (consult-grep (file-name-directory cand)))

      (embark-define-keymap consult-notes-map
                            "Keymap for Embark notes actions."
                            :parent embark-file-map
                            ("d" consult-notes-dired)
                            ("g" consult-notes-grep)
                            ("m" consult-notes-marked))

      (add-to-list 'embark-keymap-alist `(,consult-notes-category . consult-notes-map))

      ;; make embark-export use dired for notes
      (setf (alist-get consult-notes-category embark-exporters-alist) #'embark-export-dired)
      )
    )
#+end_src

** auctex [deprecated]

[[https://www.gnu.org/software/auctex/][AUCTeX - Sophisticated document creation]]

#+begin_src elisp :tangle no
  (use-package auctex
    :ensure t)
#+end_src

** init-org.el footer
   
#+BEGIN_SRC emacs-lisp

(provide 'init-org)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-org.el ends here
#+END_SRC
 
* init-dev.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-dev.el :mkdirp yes
:END:

** init-dev header

#+begin_src emacs-lisp
  ;;; init-dev.el --- Development settings -*- lexical-binding: t -*-
  ;;; Commentary:

  ;;; Code:
#+end_src

** eshell

#+begin_src emacs-lisp :tangle no
  (use-package eshell
    :ensure nil
    :config
    (setenv "http_proxy" "http://172.26.0.1:7890")
    (setenv "https_proxy" "https://172.26.0.1:7890"))
#+end_src

