emacs-config.org
** with-proxy
Reference:
+ [[https://github.com/twlz0ne/with-proxy.el][twlz0ne/with-proxy.el: Evaluate expressions with proxy]]

#+begin_src emacs-lisp
  (use-package with-proxy
    :ensure t)

  (defun ddosvoid/proxy-around (&rest args)
    "Wrap a function with proxy configuration"
    (with-proxy
     :http-server "172.26.0.1:7890"
     (apply args)))

  (defun ddosvoid/run-eshell-with-proxy ()
      "Run eshell with proxy"
    (interactive)
    (ddosvoid/proxy-around (eshell)))
#+end_src

** magit

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :hook (git-commit-mode . flyspell-mode)
    :bind (("C-x g"   . magit-status)
           ("C-x M-g" . magit-dispatch)
           ("C-c M-g" . magit-file-dispatch))
    :custom
    (magit-diff-refine-hunk t)
    (magit-ediff-dwim-show-on-hunks t))
#+end_src

** projectile
[[https://docs.projectile.mx/projectile/index.html][projectile]]

#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-mode +1)
    :bind (:map projectile-mode-map
                ("C-c p" . projectile-command-map))
    :config
    (setq projectile-track-known-projects-automatically nil))
#+end_src

** lsp-mode [deprecated]

[[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]]

#+begin_src emacs-lisp :tangle no
  (use-package lsp-mode
    :ensure t
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")
    :hook ((c++-mode . lsp))
    :commands lsp)


#+end_src

** eglot

[[https://github.com/joaotavora/eglot][eglot]]

#+begin_src emacs-lisp
  (use-package eglot
    :ensure nil
    :hook (c++-mode . eglot-ensure))
#+end_src

** eglot-booster [disabled for now]
Reference:
+ [[https://github.com/jdtsmith/eglot-booster][jdtsmith/eglot-booster: Boost eglot using lsp-booster]]

#+begin_src emacs-lisp :tangle no
  (use-package eglot-booster
    :ensure t
    :after eglot
    :quelpa (eglot-booster :fetcher github :repo "jdtsmith/eglot-booster")
    :config (eglot-booster-mode))
#+end_src

** lsp-bridge [disabled for now]
Reference:
+ [[https://github.com/manateelazycat/lsp-bridge][manateelazycat/lsp-bridge: A blazingly fast LSP client for Emacs]]

#+begin_src emacs-lisp :tangle no
  (use-package lsp-bridge
    :ensure t
    :after ('yasnippet 'markdown-mode)
    :quelpa
    (lsp-bridge
     :fetcher github
     :repo "manateelazycat/lsp-bridge"
     :files (:defaults "*.el" "*.py" "acm" "core" "langserver" "multiserver" "resources"))
    :init (global-lsp-bridge-mode))
#+end_src

** company-mode

#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :hook (c++-mode . company-mode)
    :init
    (setq company-tooltip-align-annotations t)
    (setq company-idle-delay 0.0)
    (setq company-show-numbers t) ; 给选项编号 (按快捷键 M-1、M-2 等等来进行选择).
    (setq company-minimum-prefix-length 1)) ; 只需敲 1 个字母就开始进行自动补全
#+end_src

** racket-mode [deprecated]

#+begin_src emacs-lisp :tangle no
  (use-package racket-mode
    :ensure t)
#+end_src

