lisp/init-dev.el

(use-package with-proxy
  :ensure t)

(defun ddosvoid/proxy-around (&rest args)
  "Wrap a function with proxy configuration"
  (with-proxy
   :http-server "172.26.0.1:7890"
   (apply args)))

(defun ddosvoid/run-eshell-with-proxy ()
    "Run eshell with proxy"
  (interactive)
  (ddosvoid/proxy-around (eshell)))

(use-package magit
  :ensure t
  :hook (git-commit-mode . flyspell-mode)
  :bind (("C-x g"   . magit-status)
         ("C-x M-g" . magit-dispatch)
         ("C-c M-g" . magit-file-dispatch))
  :custom
  (magit-diff-refine-hunk t)
  (magit-ediff-dwim-show-on-hunks t))

(use-package projectile
  :ensure t
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map))
  :config
  (setq projectile-track-known-projects-automatically nil))

(use-package eglot
  :ensure nil
  :hook (c++-mode . eglot-ensure))

(use-package company
  :ensure t
  :hook (c++-mode . company-mode)
  :init
  (setq company-tooltip-align-annotations t)
  (setq company-idle-delay 0.0)
  (setq company-show-numbers t) ; 给选项编号 (按快捷键 M-1、M-2 等等来进行选择).
  (setq company-minimum-prefix-length 1)) ; 只需敲 1 个字母就开始进行自动补全
