lisp/init-dev.el

(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  ;; :bind (:map markdown-mode-map
  ;;       ("C-c C-e" . markdown-do))
  )

(use-package treesit-auto
  :ensure t
  :custom
  (treesit-auto-install 'prompt)
  :config
  (setq treesit-auto-langs '(c cpp))
  (treesit-auto-add-to-auto-mode-alist '(c cpp))
  (setq ddosvoid-cpp-tsauto-config
        (make-treesit-auto-recipe
         :lang 'cpp
         :ts-mode 'c++-ts-mode
         :remap 'c++-mode
         :url "https://github.com/tree-sitter/tree-sitter-cpp"
         :revision "v0.22.0"
         :ext "\\.cpp\\'"))
  (add-to-list 'treesit-auto-recipe-list ddosvoid-cpp-tsauto-config)
  (setq treesit-font-lock-level 4)
  (global-treesit-auto-mode))

(add-hook 'prog-mode-hook 'display-line-numbers-mode)

(provide 'init-dev)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-dev.el ends here
